Friend-list/app/controllers/friends_controller.rb

UPDATE "friends" SET "last_name" = ?, "updated_at" = ? WHERE "friends"."id" = ?  [["last_name", "Elders"], ["updated_at", "2021-11-16 07:50:26.206559"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @friend.update(friend_params)